[
  {
    "title": "Proposal Writing and Submission Guide",
    "creator": "GDG IIIT Kalyani",
    "desc": "This video is a comprehensive guide to proposal writing for Winter of Code 5.0, designed to help contributors understand how to write a clear, well-structured and impactful proposal.\n\n✨ In this guide, you'll learn:\n• How to structure a strong project proposal\n• What mentors look for during evaluation\n• How to present ideas with clarity and intent\n• Common mistakes to avoid\n• Best practices to improve your chances\n\nThis guide is especially helpful for first-time open-source contributors and anyone aiming to submit a thoughtful, well-crafted proposal.\n\nWinter of Code 5.0 is all about learning, collaboration, and real-world open-source experience.🚀\nHave questions? Reach out to us on Discord or in the official discussion channels.\n\nStay tuned for more sessions and updates from Winter of Code 5.0.",
    "videoUrl": "https://www.youtube.com/watch?v=wWAwk_GiYzA&list=PLTzgn5VEtSmR97BZ8qG5_CedzZJn2IzFe&index=1",
    "videoId": "wWAwk_GiYzA"
  },
  {
    "title": "Inaugral Ceremony",
    "creator": "GDG IIIT Kalyani",
    "desc": "Welcome to the official Inaugural Ceremony of Winter of Code 5.0! 🎉\n\nThe moment we've all been waiting for is finally here. As we officially kick off Winter of Code 5.0 today, marking the beginning of an exciting and impactful open-source journey hosted by GDG On Campus IIIT Kalyani.❄️\nIn this ceremony, we'll introduce the vision, structure and roadmap of the program, walk through the timeline and contribution process and give you a glimpse of the organizations, projects and mentorship ahead.\n\nKicking things off with an outstanding lineup of speakers - renowned industry leaders and open-source advocates who are shaping the ecosystem:\n• Chris Sells \n• Vanshika Agarwal\n• Santosh Yadav\n• Praveen Kumar\n\nLet's set the stage for an unforgettable Winter of Code journey.",
    "videoUrl": "https://www.youtube.com/watch?v=a0WheoR5arw&list=PLTzgn5VEtSmR97BZ8qG5_CedzZJn2IzFe&index=2",
    "videoId": "a0WheoR5arw"
  },
  {
    "title": "Complete Registration Guide",
    "creator": "GDG IIIT Kalyani",
    "desc": "Kickstart your journey with Winter of Code 5.0 ! 🚀\nThis tutorial covers everything you need to know about the new candidate registration process, ensuring you understand each step and can join the program without any hassle.\n\n❄️ About Winter of Code 5.0\nWinter of Code 5.0 is a GSoC-inspired Open-Source program where students contribute to real projects, work closely with mentors and build a strong developer portfolio through hands-on experience.",
    "videoUrl": "https://www.youtube.com/watch?v=Szkjp9zlmgw&list=PLTzgn5VEtSmR97BZ8qG5_CedzZJn2IzFe&index=4",
    "videoId": "Szkjp9zlmgw"
  }
]
